
import { Voter } from './types';

// Approximate DOB calculation for demo: 2024 - age
export const INITIAL_VOTERS: Voter[] = [
  { id: '880750010014', name: 'মোঃ সামাদ আলী', fatherName: 'মোঃ ময়দান আলী', motherName: 'মোছাঃ খেতজা খাতুন', age: 62, dob: '01/01/1962', gender: 'পুরুষ', nid: '880750010014', ward: '১ নম্বর ওয়ার্ড', address: 'শ্রীদাসগাতী' },
  { id: '880750010017', name: 'মোঃ ছোরমান আলী', fatherName: 'মোঃ শাজাহান আলী', motherName: 'মোছাঃ খেতজা খাতুন', age: 52, dob: '01/01/1972', gender: 'পুরুষ', nid: '880750010017', ward: '১ নম্বর ওয়ার্ড', address: 'শ্রীদাসগাতী' },
  { id: '880750010019', name: 'মোঃ সাইরুল ইসলাম', fatherName: 'মোঃ হাছেন আলী', motherName: 'মোছাঃ ফাতেমা খাতুন', age: 42, dob: '01/01/1982', gender: 'পুরুষ', nid: '880750010019', ward: '১ নম্বর ওয়ার্ড', address: 'শ্রীদাসগাতী' },
  { id: '880750010020', name: 'মোঃ ইদ্রিস আলী', fatherName: 'মোঃ পরশ উল্লাহ', motherName: 'মোছাঃ জরিনা খাতুন', age: 47, dob: '01/01/1977', gender: 'পুরুষ', nid: '880750010020', ward: '১ নম্বর ওয়ার্ড', address: 'শ্রীদাসগাতী' },
  { id: '880750010021', name: 'মোঃ ইব্রাহিম সরকার', fatherName: 'মোঃ পরশ উল্লাহ', motherName: 'মোছাঃ জরিনা খাতুন', age: 52, dob: '01/01/1972', gender: 'পুরুষ', nid: '880750010021', ward: '১ নম্বর ওয়ার্ড', address: 'শ্রীদাসগাতী' },
  { id: '880750010025', name: 'ওসমান গনি মোল্লা', fatherName: 'মোঃ বাবর আলী', motherName: 'মোছাঃ ওমিছা খাতুন', age: 92, dob: '01/01/1932', gender: 'পুরুষ', nid: '880750010025', ward: '১ নম্বর ওয়ার্ড', address: 'শ্রীদাসগাতী' },
  { id: '880750010028', name: 'মোঃ নূর নবী সরকার', fatherName: 'মোঃ ওসমান গনি', motherName: 'মোছাঃ নূর নাহার', age: 52, dob: '01/01/1972', gender: 'পুরুষ', nid: '880750010028', ward: '১ নম্বর ওয়ার্ড', address: 'শ্রীদাসগাতী' },
  { id: '880750010031', name: 'মোঃ শরিফুল ইসলাম', fatherName: 'মোঃ ফজর আলী', motherName: 'মোছাঃ সাহের বানু', age: 47, dob: '01/01/1977', gender: 'পুরুষ', nid: '880750010031', ward: '১ নম্বর ওয়ার্ড', address: 'শ্রীদাসগাতী' },
  { id: '880750010032', name: 'মোঃ ফজর আলী', fatherName: 'মোঃ আব্দুর রহমান', motherName: 'মোছাঃ মিহরন খাতুন', age: 72, dob: '01/01/1952', gender: 'পুরুষ', nid: '880750010032', ward: '১ নম্বর ওয়ার্ড', address: 'শ্রীদাসগাতী' },
  { id: '880750010037', name: 'মোঃ আব্দুল করিম', fatherName: 'মোঃ আব্দুল জলিল', motherName: 'মোছাঃ পিরয়া খাতুন', age: 67, dob: '01/01/1957', gender: 'পুরুষ', nid: '880750010037', ward: '১ নম্বর ওয়ার্ড', address: 'শ্রীদাসগাতী' }
];
